In [1]:
import os
import pandas as pd
from pandas import isnull
master = pd.read_csv(os.path.join('./data/', 'master.csv'))
master.head()

,playerID,coachID,hofID,firstName,lastName,nameNote,nameGiven,nameNick,height,weight,...,birthDay,birthCountry,birthState,birthCity,deathYear,deathMon,deathDay,deathCountry,deathState,deathCity
0,aaltoan01,NaN,NaN,Antti,Aalto,NaN,Antti,NaN,73.0,210.0,...,4.0,Finland,NaN,Lappeenranta,NaN,NaN,NaN,NaN,NaN,NaN
1,abbeybr01,NaN,NaN,Bruce,Abbey,NaN,Bruce,NaN,73.0,185.0,...,18.0,Canada,ON,Toronto,NaN,NaN,NaN,NaN,NaN,NaN
2,abbotge01,NaN,NaN,George,Abbott,NaN,George Henry,Preacher,67.0,153.0,...,3.0,Canada,ON,Synenham,NaN,NaN,NaN,NaN,NaN,NaN
3,abbotre01,NaN,NaN,Reg,Abbott,NaN,Reginald Stewart,NaN,71.0,164.0,...,4.0,Canada,MB,Winnipeg,NaN,NaN,NaN,NaN,NaN,NaN
4,abdelju01,NaN,NaN,Justin,Abdelkader,NaN,NaN,NaN,73.0,195.0,...,25.0,USA,MI,Muskegon,NaN,NaN,NaN,NaN,NaN,NaN

In [2]:
master.shape

(7761, 31)

In [3]:
master.columns

Index(['playerID', 'coachID', 'hofID', 'firstName', 'lastName', 'nameNote',
       'nameGiven', 'nameNick', 'height', 'weight', 'shootCatch', 'legendsID',
       'ihdbID', 'hrefID', 'firstNHL', 'lastNHL', 'firstWHA', 'lastWHA', 'pos',
       'birthYear', 'birthMon', 'birthDay', 'birthCountry', 'birthState',
       'birthCity', 'deathYear', 'deathMon', 'deathDay', 'deathCountry',
       'deathState', 'deathCity'],
      dtype='object')

In [4]:
(master['playerID'].pipe(isnull).value_counts())

False    7520
True      241
Name: playerID, dtype: int64

In [5]:

isnull(master['playerID']).value_counts()

False    7520
True      241
Name: playerID, dtype: int64

In [6]:
master_org = master.copy()
master = master.dropna(subset=['playerID'])

In [7]:
master.shape

(7520, 31)

In [8]:
master_org.shape

(7761, 31)

In [9]:
master.columns

Index(['playerID', 'coachID', 'hofID', 'firstName', 'lastName', 'nameNote',
       'nameGiven', 'nameNick', 'height', 'weight', 'shootCatch', 'legendsID',
       'ihdbID', 'hrefID', 'firstNHL', 'lastNHL', 'firstWHA', 'lastWHA', 'pos',
       'birthYear', 'birthMon', 'birthDay', 'birthCountry', 'birthState',
       'birthCity', 'deathYear', 'deathMon', 'deathDay', 'deathCountry',
       'deathState', 'deathCity'],
      dtype='object')

In [11]:
master = master.dropna(subset=['firstNHL', 'lastNHL'], how='all')

In [12]:
master.columns

Index(['playerID', 'coachID', 'hofID', 'firstName', 'lastName', 'nameNote',
       'nameGiven', 'nameNick', 'height', 'weight', 'shootCatch', 'legendsID',
       'ihdbID', 'hrefID', 'firstNHL', 'lastNHL', 'firstWHA', 'lastWHA', 'pos',
       'birthYear', 'birthMon', 'birthDay', 'birthCountry', 'birthState',
       'birthCity', 'deathYear', 'deathMon', 'deathDay', 'deathCountry',
       'deathState', 'deathCity'],
      dtype='object')

In [13]:
master.shape

(6851, 31)

In [14]:
master = master.loc[master['lastNHL'] >= 1980]
master.shape

(4627, 31)

In [15]:
master.columns

Index(['playerID', 'coachID', 'hofID', 'firstName', 'lastName', 'nameNote',
       'nameGiven', 'nameNick', 'height', 'weight', 'shootCatch', 'legendsID',
       'ihdbID', 'hrefID', 'firstNHL', 'lastNHL', 'firstWHA', 'lastWHA', 'pos',
       'birthYear', 'birthMon', 'birthDay', 'birthCountry', 'birthState',
       'birthCity', 'deathYear', 'deathMon', 'deathDay', 'deathCountry',
       'deathState', 'deathCity'],
      dtype='object')

In [16]:
columns_to_keep = ['playerID','firstName', 'lastName', 'pos', 'birthYear', 'birthMon', 'birthDay', 'birthCountry', 'birthState', 'birthCity' ]
master[columns_to_keep].head()

,playerID,firstName,lastName,pos,birthYear,birthMon,birthDay,birthCountry,birthState,birthCity
0,aaltoan01,Antti,Aalto,C,1975.0,3.0,4.0,Finland,NaN,Lappeenranta
4,abdelju01,Justin,Abdelkader,L,1987.0,2.0,25.0,USA,MI,Muskegon
9,abidra01,Ramzi,Abid,L,1980.0,3.0,24.0,Canada,QC,Montreal
11,abrahth01,Thommy,Abrahamsson,D,1947.0,4.0,12.0,Sweden,NaN,Leksand
14,actonke01,Keith,Acton,C,1958.0,4.0,15.0,Canada,ON,Stouffville

In [17]:
master.filter(columns_to_keep).head()

,playerID,firstName,lastName,pos,birthYear,birthMon,birthDay,birthCountry,birthState,birthCity
0,aaltoan01,Antti,Aalto,C,1975.0,3.0,4.0,Finland,NaN,Lappeenranta
4,abdelju01,Justin,Abdelkader,L,1987.0,2.0,25.0,USA,MI,Muskegon
9,abidra01,Ramzi,Abid,L,1980.0,3.0,24.0,Canada,QC,Montreal
11,abrahth01,Thommy,Abrahamsson,D,1947.0,4.0,12.0,Sweden,NaN,Leksand
14,actonke01,Keith,Acton,C,1958.0,4.0,15.0,Canada,ON,Stouffville

In [18]:
master = master.filter(regex="(playerID|pos|^birth)|(Name$)")
master.columns

Index(['playerID', 'firstName', 'lastName', 'pos', 'birthYear', 'birthMon',
       'birthDay', 'birthCountry', 'birthState', 'birthCity'],
      dtype='object')

In [19]:
def mem_mib(df):
    print('{0:.2f} MiB'.format(df.memory_usage(deep=True).sum() / 1024 ** 2))
mem_mib(master)
mem_mib(master_org)

2.03 MiB
7.45 MiB

In [20]:
master['pos'].value_counts()

D      1418
C      1037
L       848
R       832
G       463
F        28
L/C       1
Name: pos, dtype: int64

In [21]:
pd.Categorical(master['pos'])

['C', 'L', 'L', 'D', 'C', ..., 'R', 'L', 'L', 'C', 'D']
Length: 4627
Categories (7, object): ['C', 'D', 'F', 'G', 'L', 'L/C', 'R']

In [22]:
def make_categorical(df, col):
    df[col] = pd.Categorical(df[col])

make_categorical(master, 'pos')
make_categorical(master, 'birthCountry')
make_categorical(master, 'birthState')
mem_mib(master)

1.29 MiB

In [23]:
master.head()

,playerID,firstName,lastName,pos,birthYear,birthMon,birthDay,birthCountry,birthState,birthCity
0,aaltoan01,Antti,Aalto,C,1975.0,3.0,4.0,Finland,NaN,Lappeenranta
4,abdelju01,Justin,Abdelkader,L,1987.0,2.0,25.0,USA,MI,Muskegon
9,abidra01,Ramzi,Abid,L,1980.0,3.0,24.0,Canada,QC,Montreal
11,abrahth01,Thommy,Abrahamsson,D,1947.0,4.0,12.0,Sweden,NaN,Leksand
14,actonke01,Keith,Acton,C,1958.0,4.0,15.0,Canada,ON,Stouffville

In [24]:
master.set_index('playerID')
master.head()

,playerID,firstName,lastName,pos,birthYear,birthMon,birthDay,birthCountry,birthState,birthCity
0,aaltoan01,Antti,Aalto,C,1975.0,3.0,4.0,Finland,NaN,Lappeenranta
4,abdelju01,Justin,Abdelkader,L,1987.0,2.0,25.0,USA,MI,Muskegon
9,abidra01,Ramzi,Abid,L,1980.0,3.0,24.0,Canada,QC,Montreal
11,abrahth01,Thommy,Abrahamsson,D,1947.0,4.0,12.0,Sweden,NaN,Leksand
14,actonke01,Keith,Acton,C,1958.0,4.0,15.0,Canada,ON,Stouffville

In [25]:
master.to_pickle(os.path.join('./data/', 'master.pkl'))

In [31]:
scoring = pd.read_csv(os.path.join('./data/', 'Scoring.csv'))
mem_mib(scoring)
scoring.shape

20.15 MiB

(45967, 31)

In [32]:
def recent_nhl_only(df):
    return df[(df['lgID'] == 'NHL') & (df['year'] >= 1980)]

scoring = recent_nhl_only(scoring)
scoring.shape

(28616, 31)

In [33]:
scoring.columns

Index(['playerID', 'year', 'stint', 'tmID', 'lgID', 'pos', 'GP', 'G', 'A',
       'Pts', 'PIM', '+/-', 'PPG', 'PPA', 'SHG', 'SHA', 'GWG', 'GTG', 'SOG',
       'PostGP', 'PostG', 'PostA', 'PostPts', 'PostPIM', 'Post+/-', 'PostPPG',
       'PostPPA', 'PostSHG', 'PostSHA', 'PostGWG', 'PostSOG'],
      dtype='object')

In [34]:
scoring = scoring.filter(regex='^(?!(Post|PP|SH)).*')
scoring.columns

Index(['playerID', 'year', 'stint', 'tmID', 'lgID', 'pos', 'GP', 'G', 'A',
       'Pts', 'PIM', '+/-', 'GWG', 'GTG', 'SOG'],
      dtype='object')

In [36]:
scoring = scoring.iloc[:, [0,1,3,6,7,8,9,14]]
scoring.columns

Index(['playerID', 'year', 'tmID', 'GP', 'G', 'A', 'Pts', 'SOG'], dtype='object')

In [38]:
make_categorical(scoring, 'tmID')
scoring.head()

    playerID  year tmID    GP    G     A   Pts    SOG
0  aaltoan01  1997  ANA   3.0  0.0   0.0   0.0    1.0
1  aaltoan01  1998  ANA  73.0  3.0   5.0   8.0   61.0
2  aaltoan01  1999  ANA  63.0  7.0  11.0  18.0  102.0
3  aaltoan01  2000  ANA  12.0  1.0   1.0   2.0   18.0
7  abdelju01  2007  DET   2.0  0.0   0.0   0.0    6.0

In [40]:
scoring.reset_index(drop=True).head()

    playerID  year tmID    GP    G     A   Pts    SOG
0  aaltoan01  1997  ANA   3.0  0.0   0.0   0.0    1.0
1  aaltoan01  1998  ANA  73.0  3.0   5.0   8.0   61.0
2  aaltoan01  1999  ANA  63.0  7.0  11.0  18.0  102.0
3  aaltoan01  2000  ANA  12.0  1.0   1.0   2.0   18.0
4  abdelju01  2007  DET   2.0  0.0   0.0   0.0    6.0

In [41]:
scoring.to_pickle(os.path.join('./data/', 'scoring.pkl'))

In [47]:
teams = pd.read_csv(os.path.join('./data/', 'Teams.csv'))
teams = recent_nhl_only(teams)
teams = teams[['year', 'tmID', 'name']]
teams.head()
teams.shape

(792, 3)

In [48]:
teams.nunique()

year    31
tmID    37
name    37
dtype: int64

In [49]:
make_categorical(teams, 'tmID')

In [50]:
teams.to_pickle(os.path.join('./data/', 'teams.pkl'))

In [52]:
team_splits = pd.read_csv(os.path.join('./data/', 'TeamSplits.csv'))
team_splits = recent_nhl_only(team_splits)
team_splits.shape

(792, 43)

In [53]:
columns_to_drop = team_splits.columns[3:11]
team_splits = team_splits.drop(columns=columns_to_drop)
team_splits.columns

Index(['year', 'lgID', 'tmID', 'SepW', 'SepL', 'SepT', 'SepOL', 'OctW', 'OctL',
       'OctT', 'OctOL', 'NovW', 'NovL', 'NovT', 'NovOL', 'DecW', 'DecL',
       'DecT', 'DecOL', 'JanW', 'JanL', 'JanT', 'JanOL', 'FebW', 'FebL',
       'FebT', 'FebOL', 'MarW', 'MarL', 'MarT', 'MarOL', 'AprW', 'AprL',
       'AprT', 'AprOL'],
      dtype='object')

In [54]:
team_splits = team_splits.drop(columns='lgID')
team_splits.shape

(792, 34)

In [55]:
make_categorical(team_splits, 'tmID')
team_splits.to_pickle(os.path.join('./data/', 'team_splits.pkl'))

In [71]:
master = pd.read_pickle(os.path.join('./data/', 'master.pkl'))
scoring = pd.read_pickle(os.path.join('./data/', 'scoring.pkl'))
teams = pd.read_pickle(os.path.join('./data/', 'teams.pkl'))
team_splits = pd.read_pickle(os.path.join('./data/', 'team_splits.pkl'))

In [72]:
master.head()

,playerID,firstName,lastName,pos,birthYear,birthMon,birthDay,birthCountry,birthState,birthCity
0,aaltoan01,Antti,Aalto,C,1975.0,3.0,4.0,Finland,NaN,Lappeenranta
4,abdelju01,Justin,Abdelkader,L,1987.0,2.0,25.0,USA,MI,Muskegon
9,abidra01,Ramzi,Abid,L,1980.0,3.0,24.0,Canada,QC,Montreal
11,abrahth01,Thommy,Abrahamsson,D,1947.0,4.0,12.0,Sweden,NaN,Leksand
14,actonke01,Keith,Acton,C,1958.0,4.0,15.0,Canada,ON,Stouffville

In [73]:
scoring.head(2)

    playerID  year tmID    GP    G    A  Pts   SOG
0  aaltoan01  1997  ANA   3.0  0.0  0.0  0.0   1.0
1  aaltoan01  1998  ANA  73.0  3.0  5.0  8.0  61.0

In [74]:
master.columns

Index(['playerID', 'firstName', 'lastName', 'pos', 'birthYear', 'birthMon',
       'birthDay', 'birthCountry', 'birthState', 'birthCity'],
      dtype='object')

In [65]:
scoring.columns

Index(['playerID', 'year', 'tmID', 'GP', 'G', 'A', 'Pts', 'SOG'], dtype='object')

In [66]:
scoring.index

Int64Index([    0,     1,     2,     3,     7,     8,     9,    10,    11,
               38,
            ...
            45957, 45958, 45959, 45960, 45961, 45962, 45963, 45964, 45965,
            45966],
           dtype='int64', length=28616)

In [75]:
scoring.index + 3

Int64Index([    3,     4,     5,     6,    10,    11,    12,    13,    14,
               41,
            ...
            45960, 45961, 45962, 45963, 45964, 45965, 45966, 45967, 45968,
            45969],
           dtype='int64', length=28616)

In [79]:
master.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 4627 entries, 0 to 7760
Data columns (total 10 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   playerID      4627 non-null   object
 1   firstName     4627 non-null   object
 2   lastName      4627 non-null   object
 3   pos           4627 non-null   category
 4   birthYear     4627 non-null   float64
 5   birthMon      4627 non-null   float64
 6   birthDay      4627 non-null   float64
 7   birthCountry  4490 non-null   category
 8   birthState    3523 non-null   category
 9   birthCity     4490 non-null   object
dtypes: category(3), float64(3), object(4)
memory usage: 306.3+ KB

In [106]:
scoring.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 28616 entries, 0 to 28615
Data columns (total 8 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   playerID  28616 non-null  object
 1   year      28616 non-null  int64
 2   tmID      28616 non-null  category
 3   GP        28508 non-null  float64
 4   G         28508 non-null  float64
 5   A         28508 non-null  float64
 6   Pts       28508 non-null  float64
 7   SOG       28508 non-null  float64
dtypes: category(1), float64(5), int64(1), object(1)
memory usage: 1.6+ MB

In [107]:
pd.merge(master, scoring,indicator=True)

,playerID,firstName,lastName,pos,birthYear,birthMon,birthDay,birthCountry,birthState,birthCity,year,tmID,GP,G,A,Pts,SOG,_merge
0,aaltoan01,Antti,Aalto,C,1975.0,3.0,4.0,Finland,NaN,Lappeenranta,1997,ANA,3.0,0.0,0.0,0.0,1.0,both
1,aaltoan01,Antti,Aalto,C,1975.0,3.0,4.0,Finland,NaN,Lappeenranta,1998,ANA,73.0,3.0,5.0,8.0,61.0,both
2,aaltoan01,Antti,Aalto,C,1975.0,3.0,4.0,Finland,NaN,Lappeenranta,1999,ANA,63.0,7.0,11.0,18.0,102.0,both
3,aaltoan01,Antti,Aalto,C,1975.0,3.0,4.0,Finland,NaN,Lappeenranta,2000,ANA,12.0,1.0,1.0,2.0,18.0,both
4,abdelju01,Justin,Abdelkader,L,1987.0,2.0,25.0,USA,MI,Muskegon,2007,DET,2.0,0.0,0.0,0.0,6.0,both
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
28611,zyuzian01,Andrei,Zyuzin,D,1978.0,1.0,21.0,Russia,NaN,Ufa,2002,MIN,66.0,4.0,12.0,16.0,113.0,both
28612,zyuzian01,Andrei,Zyuzin,D,1978.0,1.0,21.0,Russia,NaN,Ufa,2003,MIN,65.0,8.0,13.0,21.0,104.0,both
28613,zyuzian01,Andrei,Zyuzin,D,1978.0,1.0,21.0,Russia,NaN,Ufa,2005,MIN,57.0,7.0,11.0,18.0,80.0,both
28614,zyuzian01,Andrei,Zyuzin,D,1978.0,1.0,21.0,Russia,NaN,Ufa,2006,CAL,49.0,1.0,5.0,6.0,36.0,both
28615,zyuzian01,Andrei,Zyuzin,D,1978.0,1.0,21.0,Russia,NaN,Ufa,2007,CHI,32.0,2.0,3.0,5.0,34.0,both

In [164]:
#scoring = scoring.reset_index(drop=True)
mer = pd.merge(master, scoring)
mer

,playerID,firstName,lastName,pos,birthYear,birthMon,birthDay,birthCountry,birthState,birthCity,year,tmID,GP,G,A,Pts,SOG
0,aaltoan01,Antti,Aalto,C,1975.0,3.0,4.0,Finland,NaN,Lappeenranta,1997,ANA,3.0,0.0,0.0,0.0,1.0
1,aaltoan01,Antti,Aalto,C,1975.0,3.0,4.0,Finland,NaN,Lappeenranta,1998,ANA,73.0,3.0,5.0,8.0,61.0
2,aaltoan01,Antti,Aalto,C,1975.0,3.0,4.0,Finland,NaN,Lappeenranta,1999,ANA,63.0,7.0,11.0,18.0,102.0
3,aaltoan01,Antti,Aalto,C,1975.0,3.0,4.0,Finland,NaN,Lappeenranta,2000,ANA,12.0,1.0,1.0,2.0,18.0
4,abdelju01,Justin,Abdelkader,L,1987.0,2.0,25.0,USA,MI,Muskegon,2007,DET,2.0,0.0,0.0,0.0,6.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
28611,zyuzian01,Andrei,Zyuzin,D,1978.0,1.0,21.0,Russia,NaN,Ufa,2002,MIN,66.0,4.0,12.0,16.0,113.0
28612,zyuzian01,Andrei,Zyuzin,D,1978.0,1.0,21.0,Russia,NaN,Ufa,2003,MIN,65.0,8.0,13.0,21.0,104.0
28613,zyuzian01,Andrei,Zyuzin,D,1978.0,1.0,21.0,Russia,NaN,Ufa,2005,MIN,57.0,7.0,11.0,18.0,80.0
28614,zyuzian01,Andrei,Zyuzin,D,1978.0,1.0,21.0,Russia,NaN,Ufa,2006,CAL,49.0,1.0,5.0,6.0,36.0
28615,zyuzian01,Andrei,Zyuzin,D,1978.0,1.0,21.0,Russia,NaN,Ufa,2007,CHI,32.0,2.0,3.0,5.0,34.0

In [136]:
scoring['playerID'].isna().any()

False

In [167]:
pd.merge(master, scoring, left_on="playerID", right_on='playerID')

,playerID,firstName,lastName,pos,birthYear,birthMon,birthDay,birthCountry,birthState,birthCity,year,tmID,GP,G,A,Pts,SOG
0,aaltoan01,Antti,Aalto,C,1975.0,3.0,4.0,Finland,NaN,Lappeenranta,1997,ANA,3.0,0.0,0.0,0.0,1.0
1,aaltoan01,Antti,Aalto,C,1975.0,3.0,4.0,Finland,NaN,Lappeenranta,1998,ANA,73.0,3.0,5.0,8.0,61.0
2,aaltoan01,Antti,Aalto,C,1975.0,3.0,4.0,Finland,NaN,Lappeenranta,1999,ANA,63.0,7.0,11.0,18.0,102.0
3,aaltoan01,Antti,Aalto,C,1975.0,3.0,4.0,Finland,NaN,Lappeenranta,2000,ANA,12.0,1.0,1.0,2.0,18.0
4,abdelju01,Justin,Abdelkader,L,1987.0,2.0,25.0,USA,MI,Muskegon,2007,DET,2.0,0.0,0.0,0.0,6.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
28611,zyuzian01,Andrei,Zyuzin,D,1978.0,1.0,21.0,Russia,NaN,Ufa,2002,MIN,66.0,4.0,12.0,16.0,113.0
28612,zyuzian01,Andrei,Zyuzin,D,1978.0,1.0,21.0,Russia,NaN,Ufa,2003,MIN,65.0,8.0,13.0,21.0,104.0
28613,zyuzian01,Andrei,Zyuzin,D,1978.0,1.0,21.0,Russia,NaN,Ufa,2005,MIN,57.0,7.0,11.0,18.0,80.0
28614,zyuzian01,Andrei,Zyuzin,D,1978.0,1.0,21.0,Russia,NaN,Ufa,2006,CAL,49.0,1.0,5.0,6.0,36.0
28615,zyuzian01,Andrei,Zyuzin,D,1978.0,1.0,21.0,Russia,NaN,Ufa,2007,CHI,32.0,2.0,3.0,5.0,34.0

In [168]:
pd.merge(master, scoring, left_index=True, left_on="playerID", right_on='playerID', how='left')

,playerID,firstName,lastName,pos,birthYear,birthMon,birthDay,birthCountry,birthState,birthCity,year,tmID,GP,G,A,Pts,SOG
3,aaltoan01,Antti,Aalto,C,1975.0,3.0,4.0,Finland,NaN,Lappeenranta,1997,ANA,3.0,0.0,0.0,0.0,1.0
4,aaltoan01,Antti,Aalto,C,1975.0,3.0,4.0,Finland,NaN,Lappeenranta,1998,ANA,73.0,3.0,5.0,8.0,61.0
5,aaltoan01,Antti,Aalto,C,1975.0,3.0,4.0,Finland,NaN,Lappeenranta,1999,ANA,63.0,7.0,11.0,18.0,102.0
6,aaltoan01,Antti,Aalto,C,1975.0,3.0,4.0,Finland,NaN,Lappeenranta,2000,ANA,12.0,1.0,1.0,2.0,18.0
7,abdelju01,Justin,Abdelkader,L,1987.0,2.0,25.0,USA,MI,Muskegon,2007,DET,2.0,0.0,0.0,0.0,6.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
28614,zyuzian01,Andrei,Zyuzin,D,1978.0,1.0,21.0,Russia,NaN,Ufa,2002,MIN,66.0,4.0,12.0,16.0,113.0
28615,zyuzian01,Andrei,Zyuzin,D,1978.0,1.0,21.0,Russia,NaN,Ufa,2003,MIN,65.0,8.0,13.0,21.0,104.0
28616,zyuzian01,Andrei,Zyuzin,D,1978.0,1.0,21.0,Russia,NaN,Ufa,2005,MIN,57.0,7.0,11.0,18.0,80.0
28617,zyuzian01,Andrei,Zyuzin,D,1978.0,1.0,21.0,Russia,NaN,Ufa,2006,CAL,49.0,1.0,5.0,6.0,36.0
28618,zyuzian01,Andrei,Zyuzin,D,1978.0,1.0,21.0,Russia,NaN,Ufa,2007,CHI,32.0,2.0,3.0,5.0,34.0

In [169]:

pd.merge(master, scoring, left_index=True, left_on="playerID", right_on='playerID', how='right').shape

(28616, 17)

In [170]:
master2 = master.drop(master.sample(5).index)

In [174]:
pd.merge(master2, scoring, left_index=True, left_on="playerID", right_on='playerID', how='right').shape

(28616, 17)

In [175]:
pd.merge(master2, scoring, left_index=True,left_on="playerID", right_on='playerID', how='left').shape

(28595, 17)

In [176]:
merged = pd.merge(master2, scoring, left_index=True, left_on="playerID",right_on='playerID', how='outer', indicator=True)

In [177]:
master

,playerID,firstName,lastName,pos,birthYear,birthMon,birthDay,birthCountry,birthState,birthCity
0,aaltoan01,Antti,Aalto,C,1975.0,3.0,4.0,Finland,NaN,Lappeenranta
4,abdelju01,Justin,Abdelkader,L,1987.0,2.0,25.0,USA,MI,Muskegon
9,abidra01,Ramzi,Abid,L,1980.0,3.0,24.0,Canada,QC,Montreal
11,abrahth01,Thommy,Abrahamsson,D,1947.0,4.0,12.0,Sweden,NaN,Leksand
14,actonke01,Keith,Acton,C,1958.0,4.0,15.0,Canada,ON,Stouffville
...,...,...,...,...,...,...,...,...,...,...
7754,zubruda01,Dainius,Zubrus,R,1978.0,6.0,16.0,Lithuania,NaN,Elektrenai
7755,zuccama01,Mats,Zuccarello,L,1987.0,9.0,1.0,Norway,NaN,Oslo
7756,zuckeja01,Jason,Zucker,L,1992.0,1.0,16.0,NaN,NaN,NaN
7757,zukemi01,Mike,Zuke,C,1954.0,4.0,16.0,Canada,ON,Sault Ste. Marie
7760,zyuzian01,Andrei,Zyuzin,D,1978.0,1.0,21.0,Russia,NaN,Ufa

In [86]:
scoring

        playerID  year tmID    GP    G     A   Pts    SOG
0      aaltoan01  1997  ANA   3.0  0.0   0.0   0.0    1.0
1      aaltoan01  1998  ANA  73.0  3.0   5.0   8.0   61.0
2      aaltoan01  1999  ANA  63.0  7.0  11.0  18.0  102.0
3      aaltoan01  2000  ANA  12.0  1.0   1.0   2.0   18.0
7      abdelju01  2007  DET   2.0  0.0   0.0   0.0    6.0
...          ...   ...  ...   ...  ...   ...   ...    ...
45962  zyuzian01  2002  MIN  66.0  4.0  12.0  16.0  113.0
45963  zyuzian01  2003  MIN  65.0  8.0  13.0  21.0  104.0
45964  zyuzian01  2005  MIN  57.0  7.0  11.0  18.0   80.0
45965  zyuzian01  2006  CAL  49.0  1.0   5.0   6.0   36.0
45966  zyuzian01  2007  CHI  32.0  2.0   3.0   5.0   34.0

[28616 rows x 8 columns]

In [179]:
pd.merge(master, scoring, left_index=True, left_on="playerID", right_on="playerID").shape

(28616, 17)

In [180]:
merged['_merge'].value_counts()

both          28595
right_only       21
left_only         0
Name: _merge, dtype: int64

In [181]:
merged[merged['_merge'] == 'right_only'].value_counts()

Series([], dtype: int64)

In [182]:
merged[merged['_merge'] == 'right_only']

,playerID,firstName,lastName,pos,birthYear,birthMon,birthDay,birthCountry,birthState,birthCity,year,tmID,GP,G,A,Pts,SOG,_merge
2444,boyleda01,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,1998,FLO,22.0,3.0,5.0,8.0,31.0,right_only
2445,boyleda01,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,1999,FLO,13.0,0.0,3.0,3.0,9.0,right_only
2446,boyleda01,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,2000,FLO,69.0,4.0,18.0,22.0,83.0,right_only
2447,boyleda01,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,2001,FLO,25.0,3.0,3.0,6.0,31.0,right_only
2448,boyleda01,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,2001,TBL,41.0,5.0,15.0,20.0,68.0,right_only
2449,boyleda01,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,2002,TBL,77.0,13.0,40.0,53.0,136.0,right_only
2450,boyleda01,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,2003,TBL,78.0,9.0,30.0,39.0,137.0,right_only
2451,boyleda01,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,2005,TBL,79.0,15.0,38.0,53.0,153.0,right_only
2452,boyleda01,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,2006,TBL,82.0,20.0,43.0,63.0,203.0,right_only
2453,boyleda01,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,2007,TBL,37.0,4.0,21.0,25.0,74.0,right_only
2454,boyleda01,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,2008,SJS,77.0,16.0,41.0,57.0,213.0,right_only
2455,boyleda01,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,2009,SJS,76.0,15.0,43.0,58.0,180.0,right_only
2456,boyleda01,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,2010,SJS,76.0,9.0,41.0,50.0,199.0,right_only
2457,boyleda01,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,2011,SJS,81.0,9.0,39.0,48.0,252.0,right_only
5241,dahlmto01,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,2001,OTT,10.0,0.0,1.0,1.0,5.0,right_only
5242,dahlmto01,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,2002,OTT,12.0,1.0,0.0,1.0,5.0,right_only
14084,lavarma01,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,1985,CHI,2.0,0.0,0.0,0.0,2.0,right_only
14085,lavarma01,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,1986,CHI,58.0,8.0,15.0,23.0,46.0,right_only
14086,lavarma01,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,1987,CHI,18.0,1.0,1.0,2.0,17.0,right_only
22775,saundbe01,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,1980,QUE,6.0,0.0,1.0,1.0,5.0,right_only
23276,shaldye01,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,1996,BOS,3.0,1.0,0.0,1.0,5.0,right_only

In [185]:
scoring2 = scoring.drop(scoring.sample(1000).index)
merge2 = pd.merge(master2, scoring2, left_index=True, left_on="playerID", right_on='playerID', how='outer', indicator=True)
merge2

,playerID,firstName,lastName,pos,birthYear,birthMon,birthDay,birthCountry,birthState,birthCity,year,tmID,GP,G,A,Pts,SOG,_merge
3.0,aaltoan01,Antti,Aalto,C,1975.0,3.0,4.0,Finland,NaN,Lappeenranta,1997.0,ANA,3.0,0.0,0.0,0.0,1.0,both
4.0,aaltoan01,Antti,Aalto,C,1975.0,3.0,4.0,Finland,NaN,Lappeenranta,1998.0,ANA,73.0,3.0,5.0,8.0,61.0,both
5.0,aaltoan01,Antti,Aalto,C,1975.0,3.0,4.0,Finland,NaN,Lappeenranta,1999.0,ANA,63.0,7.0,11.0,18.0,102.0,both
6.0,aaltoan01,Antti,Aalto,C,1975.0,3.0,4.0,Finland,NaN,Lappeenranta,2000.0,ANA,12.0,1.0,1.0,2.0,18.0,both
7.0,abdelju01,Justin,Abdelkader,L,1987.0,2.0,25.0,USA,MI,Muskegon,2007.0,DET,2.0,0.0,0.0,0.0,6.0,both
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
14084.0,lavarma01,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,1985.0,CHI,2.0,0.0,0.0,0.0,2.0,right_only
14085.0,lavarma01,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,1986.0,CHI,58.0,8.0,15.0,23.0,46.0,right_only
14086.0,lavarma01,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,1987.0,CHI,18.0,1.0,1.0,2.0,17.0,right_only
22775.0,saundbe01,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,1980.0,QUE,6.0,0.0,1.0,1.0,5.0,right_only
23276.0,shaldye01,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,1996.0,BOS,3.0,1.0,0.0,1.0,5.0,right_only

In [187]:
merged[(merged['_merge'] == 'left_only') | (merged['_merge'] == 'right_only')].sample(5)

,playerID,firstName,lastName,pos,birthYear,birthMon,birthDay,birthCountry,birthState,birthCity,year,tmID,GP,G,A,Pts,SOG,_merge
2453,boyleda01,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,2007,TBL,37.0,4.0,21.0,25.0,74.0,right_only
22775,saundbe01,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,1980,QUE,6.0,0.0,1.0,1.0,5.0,right_only
2456,boyleda01,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,2010,SJS,76.0,9.0,41.0,50.0,199.0,right_only
2445,boyleda01,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,1999,FLO,13.0,0.0,3.0,3.0,9.0,right_only
2448,boyleda01,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,2001,TBL,41.0,5.0,15.0,20.0,68.0,right_only

In [189]:
merged[merged['_merge'].str.endswith('only')].sample(5)

,playerID,firstName,lastName,pos,birthYear,birthMon,birthDay,birthCountry,birthState,birthCity,year,tmID,GP,G,A,Pts,SOG,_merge
2447,boyleda01,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,2001,FLO,25.0,3.0,3.0,6.0,31.0,right_only
2450,boyleda01,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,2003,TBL,78.0,9.0,30.0,39.0,137.0,right_only
2455,boyleda01,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,2009,SJS,76.0,15.0,43.0,58.0,180.0,right_only
5242,dahlmto01,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,2002,OTT,12.0,1.0,0.0,1.0,5.0,right_only
14084,lavarma01,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,1985,CHI,2.0,0.0,0.0,0.0,2.0,right_only

In [190]:
pd.merge(master, scoring, left_index=True, left_on="playerID",right_on='playerID', validate='1:m').head()

,playerID,firstName,lastName,pos,birthYear,birthMon,birthDay,birthCountry,birthState,birthCity,year,tmID,GP,G,A,Pts,SOG
3,aaltoan01,Antti,Aalto,C,1975.0,3.0,4.0,Finland,NaN,Lappeenranta,1997,ANA,3.0,0.0,0.0,0.0,1.0
4,aaltoan01,Antti,Aalto,C,1975.0,3.0,4.0,Finland,NaN,Lappeenranta,1998,ANA,73.0,3.0,5.0,8.0,61.0
5,aaltoan01,Antti,Aalto,C,1975.0,3.0,4.0,Finland,NaN,Lappeenranta,1999,ANA,63.0,7.0,11.0,18.0,102.0
6,aaltoan01,Antti,Aalto,C,1975.0,3.0,4.0,Finland,NaN,Lappeenranta,2000,ANA,12.0,1.0,1.0,2.0,18.0
7,abdelju01,Justin,Abdelkader,L,1987.0,2.0,25.0,USA,MI,Muskegon,2007,DET,2.0,0.0,0.0,0.0,6.0

In [191]:
try:
    pd.merge(master, scoring, left_index=True,left_on='playerID', right_on='playerID', validate='1:1')
except ValueError as e:
    print(e)

Merge keys are not unique in right dataset; not a one-to-one merge

In [192]:
master.head(2)

,playerID,firstName,lastName,pos,birthYear,birthMon,birthDay,birthCountry,birthState,birthCity
0,aaltoan01,Antti,Aalto,C,1975.0,3.0,4.0,Finland,NaN,Lappeenranta
4,abdelju01,Justin,Abdelkader,L,1987.0,2.0,25.0,USA,MI,Muskegon

In [142]:
scoring.head(2)

    playerID  year tmID    GP    G    A  Pts   SOG
0  aaltoan01  1997  ANA   3.0  0.0  0.0  0.0   1.0
1  aaltoan01  1998  ANA  73.0  3.0  5.0  8.0  61.0

In [196]:
try:
    pd.merge(master, scoring, left_index=True,left_on='playerID', right_on='playerID', validate='m:1').head()
except ValueError as e:
    print(e)

Merge keys are not unique in right dataset; not a many-to-one merge

In [197]:
scoring.index

RangeIndex(start=3, stop=28619, step=1)

In [198]:
scoring.index + 3

RangeIndex(start=6, stop=28622, step=1)

In [146]:
scoring.index += 3

In [202]:
pd.merge(master, scoring, left_index=True, right_index=True, indicator=True).head()

,playerID_x,firstName,lastName,pos,birthYear,birthMon,birthDay,birthCountry,birthState,birthCity,playerID_y,year,tmID,GP,G,A,Pts,SOG,_merge
4,abdelju01,Justin,Abdelkader,L,1987.0,2.0,25.0,USA,MI,Muskegon,aaltoan01,1998,ANA,73.0,3.0,5.0,8.0,61.0,both
9,abidra01,Ramzi,Abid,L,1980.0,3.0,24.0,Canada,QC,Montreal,abdelju01,2009,DET,50.0,3.0,3.0,6.0,79.0,both
11,abrahth01,Thommy,Abrahamsson,D,1947.0,4.0,12.0,Sweden,NaN,Leksand,abdelju01,2011,DET,81.0,8.0,14.0,22.0,121.0,both
14,actonke01,Keith,Acton,C,1958.0,4.0,15.0,Canada,ON,Stouffville,abidra01,2003,PIT,16.0,3.0,2.0,5.0,35.0,both
18,adamlu01,Luke,Adam,L,1990.0,6.0,18.0,Canada,NL,St. John's,actonke01,1980,MTL,61.0,15.0,24.0,39.0,101.0,both

In [203]:
merged = merged.filter(regex="^(?!(birth)).*")
merged.head()

,playerID,firstName,lastName,pos,year,tmID,GP,G,A,Pts,SOG,_merge
3,aaltoan01,Antti,Aalto,C,1997,ANA,3.0,0.0,0.0,0.0,1.0,both
4,aaltoan01,Antti,Aalto,C,1998,ANA,73.0,3.0,5.0,8.0,61.0,both
5,aaltoan01,Antti,Aalto,C,1999,ANA,63.0,7.0,11.0,18.0,102.0,both
6,aaltoan01,Antti,Aalto,C,2000,ANA,12.0,1.0,1.0,2.0,18.0,both
7,abdelju01,Justin,Abdelkader,L,2007,DET,2.0,0.0,0.0,0.0,6.0,both

In [151]:
teams.sample()

     year tmID             name
975  1991  STL  St. Louis Blues

In [152]:
teams

      year tmID                 name
727   1980  BOS        Boston Bruins
728   1980  BUF       Buffalo Sabres
729   1980  CAL       Calgary Flames
730   1980  CHI  Chicago Black Hawks
731   1980  COR     Colorado Rockies
...    ...  ...                  ...
1514  2011  TBL  Tampa Bay Lightning
1515  2011  TOR  Toronto Maple Leafs
1516  2011  VAN    Vancouver Canucks
1517  2011  WAS  Washington Capitals
1518  2011  WPG        Winnipeg Jets

[792 rows x 3 columns]

In [153]:
teams.shape

(792, 3)

In [154]:
team_splits.sample()

,year,tmID,SepW,SepL,SepT,SepOL,OctW,OctL,OctT,OctOL,...,FebT,FebOL,MarW,MarL,MarT,MarOL,AprW,AprL,AprT,AprOL
750,1981,CAL,NaN,NaN,NaN,NaN,2.0,7.0,2.0,NaN,...,3.0,NaN,5.0,6.0,2.0,NaN,1.0,1.0,0.0,NaN

In [209]:
teams2 = teams[['tmID', 'name']]
teams2 = teams2.drop_duplicates()
teams2['tmID'].value_counts().head()

CHI    2
MIN    1
HAR    1
FLO    1
EDM    1
Name: tmID, dtype: int64

In [210]:
teams2

     tmID                     name
727   BOS            Boston Bruins
728   BUF           Buffalo Sabres
729   CAL           Calgary Flames
730   CHI      Chicago Black Hawks
731   COR         Colorado Rockies
732   DET        Detroit Red Wings
733   EDM          Edmonton Oilers
734   HAR         Hartford Whalers
735   LAK        Los Angeles Kings
736   MNS    Minnesota North Stars
737   MTL       Montreal Canadiens
738   NYI       New York Islanders
739   NYR         New York Rangers
740   PHI      Philadelphia Flyers
741   PIT      Pittsburgh Penguins
742   QUE         Quebec Nordiques
743   STL          St. Louis Blues
744   TOR      Toronto Maple Leafs
745   VAN        Vancouver Canucks
746   WAS      Washington Capitals
747   WIN            Winnipeg Jets
779   NJD        New Jersey Devils
856   CHI       Chicago Blackhawks
974   SJS          San Jose Sharks
993   OTT          Ottawa Senators
999   TBL      Tampa Bay Lightning
1004  ANA  Mighty Ducks of Anaheim
1009  DAL             Dallas Stars
1012  FLO         Florida Panthers
1061  COL       Colorado Avalanche
1100  PHO          Phoenix Coyotes
1112  CAR      Carolina Hurricanes
1147  NAS      Nashville Predators
1162  ATL        Atlanta Thrashers
1195  CBS    Columbus Blue Jackets
1203  MIN           Minnesota Wild
1339  AND            Anaheim Ducks
1518  WPG            Winnipeg Jets

In [211]:
teams2.loc[teams2['tmID'] == 'CHI']

    tmID                 name
730  CHI  Chicago Black Hawks
856  CHI   Chicago Blackhawks

In [213]:
teams2 = teams2[teams2['tmID'] == 'CHI']
teams_splits2 = team_splits[team_splits['tmID'] == 'CHI'].sample(2)
teams_splits2

,year,tmID,SepW,SepL,SepT,SepOL,OctW,OctL,OctT,OctOL,...,FebT,FebOL,MarW,MarL,MarT,MarOL,AprW,AprL,AprT,AprOL
856,1986,CHI,NaN,NaN,NaN,NaN,2.0,7.0,2.0,NaN,...,2.0,NaN,4.0,7.0,3.0,NaN,1.0,1.0,1.0,NaN
1256,2002,CHI,NaN,NaN,NaN,NaN,5.0,3.0,1.0,0.0,...,1.0,0.0,4.0,6.0,2.0,3.0,2.0,0.0,1.0,0.0

In [214]:
pd.merge(teams2, teams_splits2)

,tmID,name,year,SepW,SepL,SepT,SepOL,OctW,OctL,OctT,...,FebT,FebOL,MarW,MarL,MarT,MarOL,AprW,AprL,AprT,AprOL
0,CHI,Chicago Black Hawks,1986,NaN,NaN,NaN,NaN,2.0,7.0,2.0,...,2.0,NaN,4.0,7.0,3.0,NaN,1.0,1.0,1.0,NaN
1,CHI,Chicago Black Hawks,2002,NaN,NaN,NaN,NaN,5.0,3.0,1.0,...,1.0,0.0,4.0,6.0,2.0,3.0,2.0,0.0,1.0,0.0
2,CHI,Chicago Blackhawks,1986,NaN,NaN,NaN,NaN,2.0,7.0,2.0,...,2.0,NaN,4.0,7.0,3.0,NaN,1.0,1.0,1.0,NaN
3,CHI,Chicago Blackhawks,2002,NaN,NaN,NaN,NaN,5.0,3.0,1.0,...,1.0,0.0,4.0,6.0,2.0,3.0,2.0,0.0,1.0,0.0

    tmID                 name
730  CHI  Chicago Black Hawks
856  CHI   Chicago Blackhawks

,year,tmID,SepW,SepL,SepT,SepOL,OctW,OctL,OctT,OctOL,...,FebT,FebOL,MarW,MarL,MarT,MarOL,AprW,AprL,AprT,AprOL
856,1986,CHI,NaN,NaN,NaN,NaN,2.0,7.0,2.0,NaN,...,2.0,NaN,4.0,7.0,3.0,NaN,1.0,1.0,1.0,NaN
1256,2002,CHI,NaN,NaN,NaN,NaN,5.0,3.0,1.0,0.0,...,1.0,0.0,4.0,6.0,2.0,3.0,2.0,0.0,1.0,0.0

In [219]:
pd.merge(team_splits,teams,  left_on=['tmID','year'], right_on=['tmID', 'year']).head(4)

,year,tmID,SepW,SepL,SepT,SepOL,OctW,OctL,OctT,OctOL,...,FebOL,MarW,MarL,MarT,MarOL,AprW,AprL,AprT,AprOL,name
0,1980,BOS,NaN,NaN,NaN,NaN,2.0,7.0,1.0,NaN,...,NaN,8.0,4.0,3.0,NaN,1.0,2.0,0.0,NaN,Boston Bruins
1,1980,BUF,NaN,NaN,NaN,NaN,5.0,2.0,2.0,NaN,...,NaN,8.0,6.0,1.0,NaN,1.0,1.0,1.0,NaN,Buffalo Sabres
2,1980,CAL,NaN,NaN,NaN,NaN,5.0,4.0,2.0,NaN,...,NaN,6.0,6.0,2.0,NaN,2.0,0.0,0.0,NaN,Calgary Flames
3,1980,CHI,NaN,NaN,NaN,NaN,6.0,4.0,2.0,NaN,...,NaN,4.0,5.0,4.0,NaN,1.0,1.0,1.0,NaN,Chicago Black Hawks

In [207]:
teams_splits2

,year,tmID,SepW,SepL,SepT,SepOL,OctW,OctL,OctT,OctOL,...,FebT,FebOL,MarW,MarL,MarT,MarOL,AprW,AprL,AprT,AprOL
1406,2008,CHI,NaN,NaN,NaN,NaN,4.0,3.0,NaN,3.0,...,NaN,1.0,6.0,7.0,NaN,2.0,6.0,0.0,NaN,1.0

In [208]:
teams2

    tmID                 name
730  CHI  Chicago Black Hawks
856  CHI   Chicago Blackhawks

In [222]:
try:
    pd.merge(team_splits,teams,  left_on=['tmID','year'], right_on=['year','tmID' ]).head(4)
except Exception as e:
    print(e)

In [224]:
pd.merge(team_splits,teams,  on=['tmID','year' ]).head(4)

,year,tmID,SepW,SepL,SepT,SepOL,OctW,OctL,OctT,OctOL,...,FebOL,MarW,MarL,MarT,MarOL,AprW,AprL,AprT,AprOL,name
0,1980,BOS,NaN,NaN,NaN,NaN,2.0,7.0,1.0,NaN,...,NaN,8.0,4.0,3.0,NaN,1.0,2.0,0.0,NaN,Boston Bruins
1,1980,BUF,NaN,NaN,NaN,NaN,5.0,2.0,2.0,NaN,...,NaN,8.0,6.0,1.0,NaN,1.0,1.0,1.0,NaN,Buffalo Sabres
2,1980,CAL,NaN,NaN,NaN,NaN,5.0,4.0,2.0,NaN,...,NaN,6.0,6.0,2.0,NaN,2.0,0.0,0.0,NaN,Calgary Flames
3,1980,CHI,NaN,NaN,NaN,NaN,6.0,4.0,2.0,NaN,...,NaN,4.0,5.0,4.0,NaN,1.0,1.0,1.0,NaN,Chicago Black Hawks

In [225]:
pd.merge(team_splits,teams,  on=['tmID']).head(4)

,year_x,tmID,SepW,SepL,SepT,SepOL,OctW,OctL,OctT,OctOL,...,MarW,MarL,MarT,MarOL,AprW,AprL,AprT,AprOL,year_y,name
0,1980,BOS,NaN,NaN,NaN,NaN,2.0,7.0,1.0,NaN,...,8.0,4.0,3.0,NaN,1.0,2.0,0.0,NaN,1980,Boston Bruins
1,1980,BOS,NaN,NaN,NaN,NaN,2.0,7.0,1.0,NaN,...,8.0,4.0,3.0,NaN,1.0,2.0,0.0,NaN,1981,Boston Bruins
2,1980,BOS,NaN,NaN,NaN,NaN,2.0,7.0,1.0,NaN,...,8.0,4.0,3.0,NaN,1.0,2.0,0.0,NaN,1982,Boston Bruins
3,1980,BOS,NaN,NaN,NaN,NaN,2.0,7.0,1.0,NaN,...,8.0,4.0,3.0,NaN,1.0,2.0,0.0,NaN,1983,Boston Bruins

In [226]:
pd.merge(team_splits, teams, on=['tmID']).head() .filter(like='year')

   year_x  year_y
0    1980    1980
1    1980    1981
2    1980    1982
3    1980    1983
4    1980    1984

In [228]:
pd.merge(team_splits, teams, on=['tmID'], suffixes=['_team_splites', '_teams']).head() .filter(like='year')
# Like means 'year' in x == True

   year_team_splites  year_teams
0               1980        1980
1               1980        1981
2               1980        1982
3               1980        1983
4               1980        1984

In [229]:
merged = pd.merge(team_splits, teams, on=['tmID', 'year'])

In [230]:
merged.head(2)

,year,tmID,SepW,SepL,SepT,SepOL,OctW,OctL,OctT,OctOL,...,FebOL,MarW,MarL,MarT,MarOL,AprW,AprL,AprT,AprOL,name
0,1980,BOS,NaN,NaN,NaN,NaN,2.0,7.0,1.0,NaN,...,NaN,8.0,4.0,3.0,NaN,1.0,2.0,0.0,NaN,Boston Bruins
1,1980,BUF,NaN,NaN,NaN,NaN,5.0,2.0,2.0,NaN,...,NaN,8.0,6.0,1.0,NaN,1.0,1.0,1.0,NaN,Buffalo Sabres

In [232]:
merged.to_pickle(os.path.join('../', 'team_splits.pickle'))

In [234]:
df1 = pd.DataFrame([
    ['hopkide01', 4, 'R'],
    ['mairad01', 1, 'C'],
    ['chaseke01', 5, 'R'],
], 
columns=['playerID', 'goal', 'position']
)
df1 = df1.set_index('playerID', drop=True)

df3 = pd.DataFrame([
    ['hopkide01', 'R'],
    ['mairad01', 'C'],
    ['chaseke01', 'R'],
], 
columns=['playerID', 'position']
)

df3 = df3.set_index('playerID', drop=True)

df1.join([df2, df3])

pd.merge(df1, df2)

    playerID  goal position          name
0  hopkide01     4        R  Dean Hopkins
1   mairad01     1        C     Adam Mair
2  chaseke01     5        R   Kelly Chase

In [237]:
df1 = pd.DataFrame([
    ['hopkide01', 4],
    ['mairad01', 1],
    ['chaseke01', 5],
], 
columns=['playerID', 'goal']
)

df1 = df1.set_index('playerID', drop=True)

df2 = pd.DataFrame([
    ['hopkide01', 'R'],
    ['mairad01', 'C'],
    ['chaseke01', 'R'],
], 
columns=['playerID', 'position']
)

df2 = df2.set_index('playerID', drop=True)

df3 = pd.DataFrame([
    ['hopkide01', 'Dean Hopkins'],
    ['mairad01', 'Adam Mair'],
    ['chaseke01', 'Kelly Chase'],
], 
columns=['playerID', 'name']
)

df3 = df3.set_index('playerID', drop=True)

# pd.merge(df1, df2)
# df.join
df1.join([df2, df3])

           goal position          name
playerID
hopkide01     4        R  Dean Hopkins
mairad01      1        C     Adam Mair
chaseke01     5        R   Kelly Chase

In [ ]:
# df.melt()
# df.pivot()